---
date: 2025-07-15 9:00:00
title: "Личная история поиска работы в IT весной 2025 года"
cover: /stories/2025-07-15-how-to-find-a-job/cover.jpg
categories:
  - posts
tags:
  - Поиск Работы
---

Хочу поделиться, как я недавно искал работу. Расскажу, как пробовал увеличить свои шансы на успех, разбирался в системах подбора персонала, старался как можно быстрее пройти каждый этап отбора. Обязательные шаги я описал ниже. Надеюсь, это статья поможет и вам.

## 1. Подготовьте резюме

**Внимание нужно привлечь с самого старта**. Поэтому первым делом нужно привести резюме в порядок.

**Раньше — было достаточно небрежно составленного резюме. Сейчас — нужны верные(!) ключевые слова и структура(!).**

Даже если вы считаете, что резюме уже отлично выглядит, попросите знакомого рекрутера или опытного коллегу просмотреть его. Они подскажут, как лучше выделить востребованные навыки, опыт и результаты. Помогут правильно расставить акценты, чтобы рекрутер не решил, что вы пытаетесь закосить под специалиста по направлению или стеку, в котором не работали.

Если нет возможности посоветоваться со знакомыми, то воспользуйтесь советами из профессиональных сообществ или статей в интернете, это тоже может вам помочь улучшить резюме.

## 2. Оставляйте отклики на большое количество вакансий

После того, как резюме готово, начинайте активно оставлять отклики. Пару лет назад было достаточно обновить резюме и дальше отбиваться от шквала звонков. В этом году я смог дойти до **пары десятков** собеседований, оставив **более полутора тысяч** откликов. Помните, что на популярных платформах резюме почти наверняка проходит автоматическую проверку — перед рекрутерами сначала оценивают роботы. Эти системы проверки могут быть настроены некорректно или будут слишком жёстко фильтровать кандидатов. Мне помог этот способ: **сделайте подходящую выборку вакансий сами или возьмите автоматически сформированную на сайте — и откликайтесь на как можно большее количество вакансий, даже если описание кажется неточным.**

**Можно даже не читать!** Ключевые слова в резюме помогут пройти автоматический фильтр.

## 3. Проходите анкеты и автоматизированные опросы

Дальше можете столкнуться с тем, что компании используют автоматические опросные листы, которые нужно заполнить перед следующим этапом. **Здесь важно отвечать утвердительно на большинство вопросов**, чтобы не остановиться на этом этапе. Иначе резюме может не дойти до живого человека.

**Раньше этого можно было не делать в принципе, проигнорировать такого работодателя и не тратить на него время. Теперь игнорировать опросный лист уже нельзя, поскольку тогда отсеется значительная часть предложений о работе.**

## 4. Готовьтесь к выполнению тестовых заданий

После предыдущего этапа может прийти вопрос, готовы ли выполнить тестовое задание. Тестовое просят часто, но ожидание обратной связи может растянуться больше, чем на неделю. **Если это возможно, лучше выполняйте такие задания**, так как они часто являются ключевым критерием отбора.

Иногда ответ по ним затягивается, и это нужно учитывать в планировании времени. Не ждите, что тестовое задание — признак того, что работодатель качественно подходит к отбору кандидатов, обязательно свяжется с вами и вообще по достоинству оценит выполнение задания.

Однако не забывайте, что любой труд должен быть оплачен. Мы считаем этичным тестовое задание, которое вы сделаете за 4, максимум, за 8 часов. Если тестовое задание выглядит как «реализовать полноценную CRM, которую можно катить в продакшен», то это повод заподозрить компанию в недобросовестности.

## 5. Планируйте время

Спустя какое-то время после отклика на вакансию с вами начнут выходить на связь и назначать первые этапы собеседования. Рекрутеры могут писать на почту, в мессенджеры, на сайте, могут просто позвонить, так что придётся следить за всеми каналами связи. Чтобы не запутаться с назначенными встречами, **заранее составьте график на каждый день**. Разделите график на слоты по 15-30 минут. Это упростит коммуникацию на всех последующих этапах отбора.

## 6. Подготовьтесь к первому общению с рекрутером

После прохождения начальных этапов вас ждет созвон с рекрутером.

Здесь важно отвечать чётко и по делу, указывая, что **смена работы связана с объективными обстоятельствами, не зависящими от вас**. Например, сокращения, перевод всех с удалёнки на гибрид или с гибрида на офис, требуемая релокация, санкции и всё в таком духе.

Если вам предложат задать свои вопросы, **обязательно уточните, какие следующие этапы процесса отбора и когда ожидать обратной связи**.

## 7. Технические интервью

Технические собеседования — самый сложный этап. **Перед каждым** таким разговором освежите знания по ключевым темам, указанным в вакансии. Чаще всего именно по ним могут быть вопросы и практические задания.

Иногда приходится проходить несколько таких интервью подряд, поэтому готовьтесь заранее и **вовремя** повторяйте материал, касающийся конкретной вакансии. Критически важно показать свои знания по особо интересующим работодателя темам. Не пренебрегайте этим.

## 8. Финальное интервью

Если вы дошли до этапа встречи с руководителями или командой, это отличный знак. Но расслабляться рано.

**На этом этапе оценивают не столько ваши навыки, сколько способность интегрироваться в коллектив**. Отвечайте подробно и развёрнуто, делитесь своим опытом и подходом к решению задач. Интервьюеры должны понять ваш образ мышления.

Отнеситесь к этому этапу так же серьёзно, как и к техническому интервью.

## 9. Проявите интерес к компании

Если компания вам действительно понравилась, не бойтесь проявить инициативу. Например, если у вас уже есть другой оффер, но эта вакансия кажется более привлекательной, сообщите об этом. Покажите, что вы **мотивированы и готовы быстро принять решение**.

## Заключение

Сейчас на рынке сложилась такая ситуация, что поиск работы — это процесс, **требующий от работника активного действия**. Принципиальная разница между сегодняшним днём и ситуацией, которая была пару лет назад, в том, что теперь любому работнику нужно приложить немало сил, чтобы получить оффер. Чётко следуйте плану действий, будьте внимательны и аккуратны в моментах, изложенных в этой статье.

На всех этапах общения по вакансии помните, что вас проверяют на соответствие некоторому «идеальному кандидату», и вас **всё равно могут взять на работу, даже если вы не полностью подходите под требования**.

Не забывайте, что вы уже хороший работник, а эта статья поможет вам найти способ донести эту истину до работодателя.
